# Week 10
## In-Class TypeAlong

## Learning Objectives 
### In this notebook you will learn about and practice:
1. Section 1: <a id='Section 1'></a>[Section 1: Reading and examining files with pandas](#Section-1)
2. Section 2: <a id='Section 2'></a>[Section 2: Selecting Data with pandas](#Section-2)
3. Section 3: <a id='Section 3'></a>[Section 3: More practice selecting data](#Section-3)
4. Section 4: <a id='Section 4'></a>[Section 4: Conditional Selection](#Section-4)

### Additional Sources
>- Check out the `pandas` cheat sheets provided by Data Camp and posted on Canvas
>>- https://www.datacamp.com/community/blog/python-pandas-cheat-sheet

# Section 1

## What is the `pandas` module?
>- pandas is a flexible data analysis library built within the C language and is one of the fastest ways of getting from zero to answer
>- `pandas` is the go to tool for most business analysts and scientists working in python and learning to proficient in `pandas` will do wonders to your productivity and look great on your resume
>- Some say `pandas` is basically Excel on steroids
    >- `pandas` can be thought of as a mix of Python and SQL so if you know SQL working with `pandas` may come easier to you but knowing SQL is not a prerequisite for working in `pandas`
    
### Some of the useful ways in which you can use the `pandas` module include:

1. Transforming tabular data into python to work with
2. Cleaning and filtering data, whether it's missing or incomplete
3. Feature engineer new columns that can be applied in your analysis
4. Calculating statistics that answer questions (mean, median, max, min, etc)
5. Finding correlations between columns
6. Visualizing data with matplotlib

## Reading and Writing Files with the Python `pandas` Module

### Read csv or Excel files
>- csv files: `pd.read_csv('fileName.csv')`
>- Excel files: `pd.read_excel('fileName.xlsx')`
>- Multiple sheets from the same Excel file: 
>>- `xlsx = pd.ExcelFile('file.xls')` # reads in the entire workbook
>>- `df1 = pd.read_excel(xlsx, 'Sheet1')`  # reads in sheet you specify
>>- `df2 = pd.read_excel(xlsx, 'Sheet2')`

### Write csv or Excel files
>- csv files: `pd.to_csv('YourDataFrame.csv')`
>- Excel files: `pd.to_excel('YourDataFrame.xlsx')`

# Section 1
## Reading Files and Initial Data Examination with `pandas`

## Creating a `stu` DataFrame
>- Complete the following steps to practice reading in a csv file
>>- Note: You should download the `students.csv` and `students100.xlsx` files from Canvas and save it in the same director/folder that you have this notebook saved in
1. Import the pandas module and alias it `pd`

### Step 1: Check your working directory and make sure you have the `students.csv` and `students100.xlxs` files there
>- Note: There are several ways to do this

In [1]:
pwd

'C:\\Users\\lukasz\\Desktop\\BAIM 3220 Python'

In [2]:
ls

 Volume in drive C is Windows
 Volume Serial Number is 8650-7A23

 Directory of C:\Users\lukasz\Desktop\BAIM 3220 Python

05/03/2021  12:28 PM    <DIR>          .
05/03/2021  12:28 PM    <DIR>          ..
04/29/2021  08:20 AM    <DIR>          .ipynb_checkpoints
04/29/2021  08:12 AM         1,752,916 BAIM3220_FinalReviewGuide.ipynb
04/14/2021  10:05 AM             6,883 Basics_InClassActivity.ipynb
04/22/2021  06:00 PM            94,579 ClassActivity_420LukaszStefanowiczCOMPLETED.ipynb
04/17/2021  10:07 AM        15,349,323 complete.csv
04/29/2021  01:04 PM            17,244 ControlFlow_TypeAlong_.ipynb
04/20/2021  09:28 AM               485 customer.csv
04/29/2021  08:11 AM            12,970 Dictionaries_Review.ipynb
04/19/2021  02:56 PM            21,478 Dictionaries_TypeAlong.ipynb
04/29/2021  01:04 PM            23,278 Dictionaries_TypeAlong_.ipynb
04/29/2021  01:04 PM             9,150 DictionariesPart2_TypeAlong_.ipynb
04/13/2021  09:22 AM             9,145 DictionariesPart2_TypeAlongCOMPLETED.ipynb
04/21/2021  05:16 PM            49,774 foodplot4.png
04/29/2021  01:04 PM             9,326 ForLoops_TypeAlong_.ipynb
04/29/2021  01:04 PM            54,394 FunctionsPractice_TypeAlong_.ipynb
03/30/2021  09:57 AM             3,837 Future50.csv
04/12/2021  01:20 PM           162,812 Homework6 Lukasz Stefanowicz.ipynb
04/13/2021  10:45 AM            25,428 Homework6.ipynb
04/20/2021  09:28 AM               206 invoice.csv
04/01/2021  08:52 AM        33,633,170 JEOPARDY_CSV.csv
04/20/2021  09:28 AM               496 line.csv
04/29/2021  01:04 PM             3,960 listCompAndDictionaries_.ipynb
04/29/2021  01:04 PM            30,061 Lists_TypeAlong!.ipynb
04/13/2021  09:31 AM            38,013 loans.csv
05/03/2021  12:13 PM           110,122 Lukasz Stefanowicz Homework 5.ipynb
03/30/2021  10:48 AM            54,263 Lukasz Stefanowicz Mar30_InClass.ipynb
04/17/2021  11:15 AM             5,761 LukaszStefanowiczQuiz3NEW.ipynb
04/29/2021  01:04 PM            20,726 ManipulatingStrings_TypeAlong_.ipynb
04/19/2021  03:40 PM         1,008,821 merged.ipynb
04/19/2021  03:39 PM                 0 'merged.ipynb'
04/19/2021  03:40 PM         1,007,775 merged2.ipynb
04/19/2021  03:42 PM         1,007,776 merged3.ipynb
04/19/2021  03:43 PM         1,007,776 merged4.ipynb
04/19/2021  03:45 PM         1,007,776 merged5.ipynb
04/19/2021  03:46 PM                 0 'merged5.ipynb'
04/13/2021  07:49 AM           154,182 MidtermReview.ipynb
04/13/2021  07:47 AM           162,212 MidtermReviewKey.ipynb
04/17/2021  10:46 AM                 0 -o
04/08/2021  09:32 AM           513,685 Panda Practice.ipynb
03/29/2021  04:39 PM           171,552 Panda Practice-Copy1.ipynb
04/29/2021  01:04 PM           154,383 Pandas_FindandReplace_TypeAlong_.ipynb
04/19/2021  12:31 PM           157,794 Pandas_FindandReplace_TypeAlongCOMPLETED.ipynb
04/29/2021  01:04 PM           192,151 Pandas_Part4_Grouping_TypeAlong_.ipynb
04/19/2021  03:41 PM           232,049 Pandas_Part4_Grouping_TypeAlongCOMPLETED.ipynb
04/29/2021  01:04 PM           176,008 Pandas_SumAggregateAndMapping_.ipynb
04/19/2021  03:41 PM           144,641 Pandas_SumAggregateAndMappingCOMPLETED.ipynb
04/29/2021  01:04 PM           205,209 Pandas2_Indexing-Selecting-Assigning_TypeAlong_.ipynb
04/12/2021  09:14 PM           198,946 Pandas2_Indexing-Selecting-Assigning_TypeAlongCOMPLETED.ipynb
04/29/2021  01:04 PM           783,353 Pandas6_CombiningData_TypeAlong_.ipynb
04/20/2021  09:25 AM           785,353 Pandas6_CombiningData_TypeAlongCompleted.ipynb
04/13/2021  07:42 AM            62,963 PandasIntro-TypeAlongMOSTLYDONESOMETHINGWRONG.ipynb
04/29/2021  01:04 PM            89,106 PandasIntro-TypeAlongNotebook_.ipynb
04/17/2021  10:45 AM                 0 'Pandasmergedapril.ipynb'
04/19/2021  12:33 PM                 0 'PandasMergedPart4and5'
04/19/2021  12:35 PM                 0 'PandasMergedPart4and5.ipynb'
04/22/2021  10:23 AM            14,637 PandasOnWikiData_TypeAlong.ipynb
04/29/2021  08:19 AM           212,292 PandasOnWikiData_TypeAlong_Completed.ipynb
04/13/2021  10:44 AM           349,333 PandasReview.ipynb
04/29/2021  01:04 PM           508,204 PandasReview_.ipynb
04/21/2021  05:16 PM            10,588 pieplot.png
04/19/2021  09:42 AM         4,839,076 Plant_1_Generation_Data.csv
04/19/2021  09:42 AM           287,847 Plant_1_Weather_Sensor_Data.csv
04/29/2021  01:04 PM            11,931 PracticeWithFunctions_typeAlong!.ipynb
04/20/2021  09:28 AM             1,164 product.csv
04/19/2021  03:46 PM            17,634 PythonBasics_TypeAlong.ipynb
04/21/2021  05:11 PM           304,053 sdfTester
03/30/2021  09:35 AM           720,589 squirrel.csv
04/22/2021  05:39 PM               872 state-abbrevs.csv
04/22/2021  05:39 PM               835 state-areas.csv
04/22/2021  05:46 PM            60,480 state-population.csv
04/13/2021  11:01 AM             5,229 Stefanowicz Lukasz Quiz 3.ipynb
04/13/2021  08:52 AM             8,744 Stefanowicz_Lukasz_hw4.ipynb
04/14/2021  08:59 AM             7,683 Stefanowicz_Lukasz_w2d1.ipynb
03/25/2021  10:05 AM             4,009 students.csv
03/24/2021  11:08 AM            15,372 students100.xlsx
03/24/2021  11:08 AM            27,218 Top250.csv
04/12/2021  08:54 PM           542,107 topUS.csv
04/12/2021  08:54 PM           213,902 topUs.xlsx
03/29/2021  04:06 PM             2,197 Untitled.ipynb
04/19/2021  12:35 PM             1,835 Untitled1.ipynb
04/19/2021  01:06 PM            62,882 Untitled2.ipynb
04/19/2021  02:15 PM             1,221 Untitled3.ipynb
04/19/2021  02:17 PM               555 Untitled4.ipynb
04/22/2021  10:35 AM               690 Untitled5.ipynb
04/29/2021  09:06 AM            83,951 Untitled6.ipynb
04/20/2021  09:29 AM               570 vendor.csv
04/21/2021  05:41 PM            29,628 Week 15 practice.ipynb
04/20/2021  10:34 AM           209,545 Week15_VizTypeAlong.ipynb
04/22/2021  10:05 AM           577,168 Week15_VizTypeAlong_Completed.ipynb
03/29/2021  11:31 AM        52,796,676 winemag-data-130k-v2.csv
              89 File(s)    122,654,028 bytes
               3 Dir(s)  115,946,442,752 bytes free

### Step 2: import the `pandas` module and alias it `pd`

In [3]:
import pandas as pd

### Step 3: Read the `students.csv` file into a pandas dataframe named, `stu`
>- Look at the first five records to make sure `stu` is imported correctly

#### Loading a CSV file
function: `pd.read_csv()`

[Docu read_csv](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html?highlight=read_excel#pandas.read_excel)

In [6]:
stu=pd.read_csv('students.csv',index_col='studentID')
stu

          firstName    lastName   birthdate     Points
studentID
1               Amy      Willis  10/23/1991  18.032651
2            Donald      Pierce    4/7/1990  79.671554
3              Adam      Holmes   5/16/1991  10.495381
4           Patrick       Payne  12/29/1990  33.449285
5             Chris       Lynch   10/3/1990  33.654615
...             ...         ...         ...        ...
96          Matthew  Cunningham   11/5/1991  84.951415
97            Kelly       Lynch   3/18/1990   4.377005
98             Ryan      Little  12/23/1988  52.021577
99           Willie      Taylor   12/6/1989  13.154354
100            Lisa      Austin  11/17/1990  94.808464

[100 rows x 4 columns]

#### Now, set the index column of `stu` to the studentID column
>- Note: make sure to make this change in-place
>- There are several ways to do this. Below are couple of options

1. Use the `index_col` option when reading in the file
2. Look up the `set_index` method and apply it to `stu`

In [7]:
stu.set_index(['studentID'])

KeyError: "None of ['studentID'] are in the columns"

#### Look at the first five records after you have set the index

In [8]:
stu.head(5)

          firstName lastName   birthdate     Points
studentID
1               Amy   Willis  10/23/1991  18.032651
2            Donald   Pierce    4/7/1990  79.671554
3              Adam   Holmes   5/16/1991  10.495381
4           Patrick    Payne  12/29/1990  33.449285
5             Chris    Lynch   10/3/1990  33.654615

#### Show the last five records of `stu`

In [9]:
stu.tail(5)

          firstName    lastName   birthdate     Points
studentID
96          Matthew  Cunningham   11/5/1991  84.951415
97            Kelly       Lynch   3/18/1990   4.377005
98             Ryan      Little  12/23/1988  52.021577
99           Willie      Taylor   12/6/1989  13.154354
100            Lisa      Austin  11/17/1990  94.808464

#### Show a tuple of the number of columns and rows in `stu`

In [10]:
stu.shape
#get the number of rows and columns.

(100, 4)

In [14]:
stu.info()
#displays rows and colums and etc.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 1 to 100
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   firstName  100 non-null    object
 1   lastName   100 non-null    object
 2   birthdate  100 non-null    object
 3   Points     100 non-null    float64
dtypes: float64(1), object(3)
memory usage: 3.9+ KB

#### Show the number rows another way

In [15]:
len(stu)

100

#### Show the columns in `stu`

In [16]:
len(stu.columns)

4

#### Show the datatypes that are in `stu`

In [17]:
stu.dtypes
#returns a series with the data types of each column.

firstName     object
lastName      object
birthdate     object
Points       float64
dtype: object

# Section 2
## Accessing Data using `pandas`

#### Access all the records of the `firstName` Column Only
>- Try doing this three different ways

In [12]:
stu['firstName']
#to select the column 'firstName' you can pass the column name as a string to the index.
#returns a series object

studentID
1          Amy
2       Donald
3         Adam
4      Patrick
5        Chris
        ...
96     Matthew
97       Kelly
98        Ryan
99      Willie
100       Lisa
Name: firstName, Length: 100, dtype: object

In [13]:
stu[['firstName']]
#passed as a list and returns a dataframe object

          firstName
studentID
1               Amy
2            Donald
3              Adam
4           Patrick
5             Chris
...             ...
96          Matthew
97            Kelly
98             Ryan
99           Willie
100            Lisa

[100 rows x 1 columns]

In [14]:
stu.loc[:,'firstName']
# .loc is a label based filtering method

studentID
1          Amy
2       Donald
3         Adam
4      Patrick
5        Chris
        ...
96     Matthew
97       Kelly
98        Ryan
99      Willie
100       Lisa
Name: firstName, Length: 100, dtype: object

In [21]:
stu.iloc[:,1]
#iloc uses number indexes.

studentID
1          Willis
2          Pierce
3          Holmes
4           Payne
5           Lynch
          ...
96     Cunningham
97          Lynch
98         Little
99         Taylor
100        Austin
Name: lastName, Length: 100, dtype: object

#### Show all the data for rows 3 to 10

In [22]:
stu.iloc[3:11]
#add one to rows for iloc

          firstName   lastName   birthdate     Points
studentID
4           Patrick      Payne  12/29/1990  33.449285
5             Chris      Lynch   10/3/1990  33.654615
6          Clarence     George   4/29/1988  79.655349
7             James     Lawson  10/17/1989   8.996545
8           Barbara  Robertson   12/5/1991  60.141281
9             Louis    Simpson  12/13/1990  58.775231
10           Dennis    Gilbert   12/7/1990  29.948968
11           Andrew   Thompson   6/25/1988   8.550434

#### Show all the data in the last row

In [23]:
stu.iloc[[-1]]

          firstName lastName   birthdate     Points
studentID
100            Lisa   Austin  11/17/1990  94.808464

In [24]:
stu.tail(1)

          firstName lastName   birthdate     Points
studentID
100            Lisa   Austin  11/17/1990  94.808464

#### Show the first 3 records of the third column
>- Try doing this in three different ways

In [25]:
stu.iloc[0:3,2]
#1st way
#so the item in the index is the row(slice),and the second is the column)

studentID
1    10/23/1991
2      4/7/1990
3     5/16/1991
Name: birthdate, dtype: object

In [26]:
stu.loc[0:3,'lastName']
#2nd way

studentID
1    Willis
2    Pierce
3    Holmes
Name: lastName, dtype: object

#### Show the last 3 records of the first and last columns
>- Try doing this in three different ways

In [27]:
#1st way,give a slice for the row and give the column names as the column indices
stu[-3:]['studentId' and 'Points']

studentID
98     52.021577
99     13.154354
100    94.808464
Name: Points, dtype: float64

In [15]:
#2nd way
#stu.iloc[-3:,[0,4]]

IndexError: positional indexers are out-of-bounds

# Section 3
## More practice and notes on selecting data
>- `iloc` - index based selection
>- `loc` - label based selection

### Additional Source for DataFrame Methods

[Docu DF Methods](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html)

## `.iloc(arg1, arg2)`

accesses data by row and column  (i stands for integer)

`arg1`: row number

`arg2`: column number

first row has index 0 <br>
first column has index 0 <br>
index column is always shown (not included in column count)

### First, let's remind ourselves what the `stu` DataFrame looks like
>- Show the first five records of the `stu` DataFrame

In [29]:
stu.iloc[:5]

          firstName lastName   birthdate     Points
studentID
1               Amy   Willis  10/23/1991  18.032651
2            Donald   Pierce    4/7/1990  79.671554
3              Adam   Holmes   5/16/1991  10.495381
4           Patrick    Payne  12/29/1990  33.449285
5             Chris    Lynch   10/3/1990  33.654615

### Using `iloc()`, show the first ten records of the first 2 columns of `stu`

In [30]:
stu.iloc[:10,:2]

          firstName   lastName
studentID
1               Amy     Willis
2            Donald     Pierce
3              Adam     Holmes
4           Patrick      Payne
5             Chris      Lynch
6          Clarence     George
7             James     Lawson
8           Barbara  Robertson
9             Louis    Simpson
10           Dennis    Gilbert

### Using `iloc()` show rows 2-10 for the last two columns of `stu`

In [31]:
stu.iloc[2:11,-2:]
#slice rows 2-10,for last 2 columns

            birthdate     Points
studentID
3           5/16/1991  10.495381
4          12/29/1990  33.449285
5           10/3/1990  33.654615
6           4/29/1988  79.655349
7          10/17/1989   8.996545
8           12/5/1991  60.141281
9          12/13/1990  58.775231
10          12/7/1990  29.948968
11          6/25/1988   8.550434

### Using `iloc()` show rows 85 to the end of the DataFrame for all columns

In [32]:
stu.iloc[85:, :]
#slice from 85 to the end, :means all columns (an undefined slice)

          firstName    lastName   birthdate     Points
studentID
86          Charles    Martinez    4/7/1988  83.866490
87          Anthony       Baker   8/14/1989  68.802021
88          Matthew        Sims   8/14/1990  78.932542
89            Robin     Collins    9/9/1991   1.619006
90              Ann      Powell   2/27/1988  54.369955
91             Earl   Robertson   1/26/1989  45.399924
92            Helen    Morrison   5/13/1988  90.407461
93            David        Dean   9/28/1989  78.979862
94            Alice         Fox   8/14/1989  27.961554
95           Donald     Nichols   5/17/1988  71.406950
96          Matthew  Cunningham   11/5/1991  84.951415
97            Kelly       Lynch   3/18/1990   4.377005
98             Ryan      Little  12/23/1988  52.021577
99           Willie      Taylor   12/6/1989  13.154354
100            Lisa      Austin  11/17/1990  94.808464

### Using `iloc()`, show columns 2 to 4 (lastName to Points) for all records

In [33]:
stu.iloc[:,1:5]

             lastName   birthdate     Points
studentID
1              Willis  10/23/1991  18.032651
2              Pierce    4/7/1990  79.671554
3              Holmes   5/16/1991  10.495381
4               Payne  12/29/1990  33.449285
5               Lynch   10/3/1990  33.654615
...               ...         ...        ...
96         Cunningham   11/5/1991  84.951415
97              Lynch   3/18/1990   4.377005
98             Little  12/23/1988  52.021577
99             Taylor   12/6/1989  13.154354
100            Austin  11/17/1990  94.808464

[100 rows x 3 columns]

### Using `iloc()`, show rows 20 to 25, columns 1 to 2 (firstname and lastname)

In [64]:
stu.iloc[19:25,0:2]

          firstName    lastName
studentID
20             Eric       Adams
21             Jose       White
22            Susan      Little
23           Angela         Ray
24          Raymond      Garcia
25            Emily  Richardson

### Using `iloc()`, show rows 1,5,7 and columns 1,4 (firstName and Points)

In [62]:
stu.iloc[[0,4,6],[0,3]]

          firstName     Points
studentID
1               Amy  18.032651
5             Chris  33.654615
7             James   8.996545

## `.loc`, label-based selection

>- Use index values to show specific rows
>- Use column labels to show specific columns

### Using `loc` show students with student number 75-80

In [73]:
stu.loc[75:80]

          firstName  lastName  birthdate     Points
studentID
75            Norma     Lynch  12/2/1991  46.269019
76            Jason   Freeman   6/1/1989  34.684327
77           Thomas  Lawrence  3/15/1991  90.077218
78           Daniel   Wallace  3/25/1991  82.183959
79          Charles    Austin  10/6/1990  72.173290
80          Brandon     Clark  11/8/1990  99.585281

### Using `loc` show the `birthdate` of studentIds of 10-15

In [75]:
stu.loc[10:15]['birthdate']

studentID
10    12/7/1990
11    6/25/1988
12    4/29/1990
13    2/13/1990
14    2/19/1988
15    5/14/1989
Name: birthdate, dtype: object

### Using `loc`, show the birthdate and points for student ids between 3 and 8

In [80]:
stu.loc[3:8][['birthdate','Points']]

            birthdate     Points
studentID
3           5/16/1991  10.495381
4          12/29/1990  33.449285
5           10/3/1990  33.654615
6           4/29/1988  79.655349
7          10/17/1989   8.996545
8           12/5/1991  60.141281

### Using `loc`, show the last name and points for student ids of 1, 50, and 100

In [82]:
stu.loc[[1,5,100]][['lastName','Points']]

          lastName     Points
studentID
1           Willis  18.032651
5            Lynch  33.654615
100         Austin  94.808464

# Section 4
## Conditional Selection with `loc`

### Using `loc` show the students with point values greater than 90

In [85]:
stu.loc[stu['Points']>90]

          firstName  lastName   birthdate     Points
studentID
17            Kevin    Kelley   12/8/1991  94.010548
33             Paul     Meyer   6/14/1988  98.565056
53           Eugene   Simpson   10/6/1990  97.350789
68           Bonnie     Davis  12/29/1990  98.024765
77           Thomas  Lawrence   3/15/1991  90.077218
80          Brandon     Clark   11/8/1990  99.585281
81            Tammy   Andrews  10/10/1989  95.620905
92            Helen  Morrison   5/13/1988  90.407461
100            Lisa    Austin  11/17/1990  94.808464

### Using `loc` show students with points between 50 and 60

In [87]:
stu.loc[(stu['Points']>50)&(stu['Points']<60)]

          firstName  lastName   birthdate     Points
studentID
9             Louis   Simpson  12/13/1990  58.775231
30            Laura      Boyd   9/11/1989  56.196735
34            Steve    Arnold   7/19/1991  50.544916
35             Lori     Ellis    2/9/1991  59.719574
52            Carol    Chavez   7/12/1989  56.221652
56          Richard  Morrison   5/25/1991  56.677096
71            Kevin  Campbell   9/28/1991  52.267152
90              Ann    Powell   2/27/1988  54.369955
98             Ryan    Little  12/23/1988  52.021577

### Show students with points either less than 10 or greater than 90

In [89]:
stu.loc[(stu['Points']>90)|(stu['Points']<10)]

          firstName  lastName   birthdate     Points
studentID
7             James    Lawson  10/17/1989   8.996545
11           Andrew  Thompson   6/25/1988   8.550434
16           Jeremy  Hamilton  10/12/1991   6.864933
17            Kevin    Kelley   12/8/1991  94.010548
24          Raymond    Garcia   12/8/1989   5.904415
29           Andrea   Perkins   3/26/1988   1.413170
33             Paul     Meyer   6/14/1988  98.565056
39             Jose    Rivera    7/5/1991   2.994308
43            Julie     Smith   8/10/1989   7.022810
45           Philip    Gibson   8/27/1988   0.691375
53           Eugene   Simpson   10/6/1990  97.350789
66             Judy     Green   2/11/1991   8.314689
68           Bonnie     Davis  12/29/1990  98.024765
77           Thomas  Lawrence   3/15/1991  90.077218
80          Brandon     Clark   11/8/1990  99.585281
81            Tammy   Andrews  10/10/1989  95.620905
89            Robin   Collins    9/9/1991   1.619006
92            Helen  Morrison   5/13/1988  90.407461
97            Kelly     Lynch   3/18/1990   4.377005
100            Lisa    Austin  11/17/1990  94.808464

### Find students with last name 'Holmes'

In [91]:
stu.loc[stu['lastName']=='Holmes']

          firstName lastName  birthdate     Points
studentID
3              Adam   Holmes  5/16/1991  10.495381

### Find students whose birth date is in 1989
>- Hint: apply `.str.endswith()` when accessing the `birthdate` column
>>- Check the data type of the birthdate field to understand why we can use a string method on a date

In [93]:
stu.loc[stu['birthdate'].str.endswith('1989')]

          firstName   lastName   birthdate     Points
studentID
7             James     Lawson  10/17/1989   8.996545
15           Donald     Brooks   5/14/1989  30.137299
20             Eric      Adams  10/17/1989  40.671247
24          Raymond     Garcia   12/8/1989   5.904415
28           Eugene     Medina   7/18/1989  25.228596
30            Laura       Boyd   9/11/1989  56.196735
37         Kimberly    Stevens   11/1/1989  34.823920
43            Julie      Smith   8/10/1989   7.022810
48          Anthony     Cooper    2/7/1989  69.204829
52            Carol     Chavez   7/12/1989  56.221652
57          Patrick    Garrett   7/18/1989  42.514658
61            Kevin       West   1/30/1989  13.891525
69            Diana  Armstrong   5/18/1989  20.902868
70            Betty      Olson    1/1/1989  73.081122
73            Annie  Hernandez  11/15/1989  60.804423
76            Jason    Freeman    6/1/1989  34.684327
81            Tammy    Andrews  10/10/1989  95.620905
87          Anthony      Baker   8/14/1989  68.802021
91             Earl  Robertson   1/26/1989  45.399924
93            David       Dean   9/28/1989  78.979862
94            Alice        Fox   8/14/1989  27.961554
99           Willie     Taylor   12/6/1989  13.154354

### Find students whose first name starts with 'A'

In [94]:
stu.loc[stu['firstName'].str.startswith('A')]

          firstName   lastName   birthdate     Points
studentID
1               Amy     Willis  10/23/1991  18.032651
3              Adam     Holmes   5/16/1991  10.495381
11           Andrew   Thompson   6/25/1988   8.550434
23           Angela        Ray   3/31/1991  36.966729
29           Andrea    Perkins   3/26/1988   1.413170
47            Aaron      Hicks   5/25/1990  19.653815
48          Anthony     Cooper    2/7/1989  69.204829
67             Adam  Armstrong   1/18/1990  27.772003
73            Annie  Hernandez  11/15/1989  60.804423
87          Anthony      Baker   8/14/1989  68.802021
90              Ann     Powell   2/27/1988  54.369955
94            Alice        Fox   8/14/1989  27.961554

### Find students whose `lastName` starts with 'C' that have 90 or more `Points`

In [96]:
stu.loc[(stu['lastName'].str.startswith('C'))&(stu['Points']>=90)]

          firstName lastName  birthdate     Points
studentID
80          Brandon    Clark  11/8/1990  99.585281

### Find students whose `lastName` starts with 'C' or 'B' with 80 or more `Points`

In [102]:
stu.loc[(stu['lastName'].str.startswith('B')|stu['lastName'].str.startswith('C'))&(stu['Points']>=80)]

          firstName    lastName  birthdate     Points
studentID
80          Brandon       Clark  11/8/1990  99.585281
96          Matthew  Cunningham  11/5/1991  84.951415

In [104]:
stu.loc[(stu['lastName'].str.startswith('B'))]

          firstName lastName  birthdate     Points
studentID
15           Donald   Brooks  5/14/1989  30.137299
30            Laura     Boyd  9/11/1989  56.196735
59           Daniel   Bryant  2/18/1990  41.874277
87          Anthony    Baker  8/14/1989  68.802021